[
  {
    "id": "2",
    "timestamp": "2025-03-21 23:05:37",
    "filename": "resourcesRC_Conversation_Sample.mp3",
    "transcript": " Hello, everyone. My name is Tom and today I have with me to my awesome colleagues and we can start by getting them introduced Samir. Hey, everyone. This is Samir and I help in articulating the value provided by our open platform and the plethora of use cases that can be supported. Let's go to the next one. Hi, everyone. My name is Will and I talk about the how how do we use the APIs? How do we integrate them? How do we deploy them go live in our production applications? Awesome. Thanks, guys. Today the topic is about Ring Central's AI APIs around conversational intelligence. So let's get started. Question for Samir. AI is very highly used acronym over the past 45 years, especially. How do you understand it in context of conversations? What capabilities does it bring? And how easy is it to use? Very well, Tom. You hit the nail on the head. Yes, AI is very, very highly used acronym for last. I would say 5 to 6 years. But when you think about AI in context of conversations like first thing that comes to the mind is speech to text capability or text to speech capabilities, right? But I think it's much, much beyond that. For example, you can do a lot of interaction analysis sentiment analysis and emotion analysis with these APIs that we offer. It means if you are in a contact center kind of a use case where supervisor needs to understand what kind of calls are coming in right from all the people around the world to understand the sentiment level. They can simply have a point or zero to five to figure out the calls coming in fall in what range to understand the sentiment of those calls, right? That's one of the biggest biggest powers that we gave through our AI APIs. Wow, that is so interesting. Next question I have here is for Will. What are the different set of APIs that we just support today? And how can you throw some light on the three of the top most used conversational intelligence API use cases across our portfolio of API products? Yeah, great question. We support basically APIs at two categories. One, their audio APIs and the other set of APIs are based on text and the three most popular APIs are you can say the speech to text because even audio gets converted into text and then the AI engine gives you the transcript of that. And it can give you transcript with punctuation such as comma so that you can turn it into a report. Another API very popular is the speaker diureization API. So for example, there are multiple people here in this meeting and the API will tell you which speaker is speaking at which point of time who spoke what essentially. And then there is another API that does speaker identification. This is similar to speaker diureization API. It detects who speaking. And if the AI model has been trained by the speaker's voice, it can tell you who the person is if you provide a label such as the name the person and then it will tell you, for example, Will is speaking at this time. Otherwise, it will just say person a person be person see. That's great. Well, Samir, well, thank you so much again for explaining the wise and the house of ring Central's open platform and specifically our intelligent APIs. This program's in beta right now. We'll soon be working toward releasing it generally available to the public. So please stay tuned and we look forward to getting some feedback from you.",
    "minutes": "MEETING MINUTES\n================\nDate: 2025-03-21 23:05\n\n**Meeting Minutes - Ring Central's AI APIs around Conversational Intelligence**\n\n**Date:** [Insert Date]\n**Attendees:** Tom, Samir, Will\n**Objective:** To introduce Ring Central's AI APIs around conversational intelligence and discuss their capabilities and use cases.\n\n**Key Points:**\n\n1. Ring Central's AI APIs offer capabilities beyond speech-to-text and text-to-speech, including interaction analysis, sentiment analysis, and emotion analysis.\n2. The APIs support both audio and text-based interactions.\n3. The three most popular conversational intelligence API use cases are:\n\t* Speech-to-text API: converts audio to text with punctuation.\n\t* Speaker diarization API: identifies which speaker is speaking at a given point in time.\n\t* Speaker identification API: identifies the speaker based on their voice and can label them with a name.\n\n**Action Items:**\n\n1. Samir will provide a detailed overview of the API documentation and use cases to the team.\n2. Will will work on integrating the APIs into production applications.\n3. Tom will coordinate with the team to gather feedback on the API program and provide updates on its general availability.\n\n**Decisions Made:**\n\n1. The API program is currently in beta and will soon be released generally available to the public.\n2. The team will provide feedback on the API program and its capabilities.\n\n**Discussion Details:**\n\nThe meeting began with introductions from Samir and Will, who explained their roles and responsibilities. Tom then introduced the topic of Ring Central's AI APIs around conversational intelligence. Samir provided an overview of the APIs, highlighting their capabilities and use cases. Will discussed the different sets of APIs supported by Ring Central and provided examples of the top three most used conversational intelligence API use cases. The team discussed the potential applications of the APIs and their benefits.\n\n**Next Steps:**\n\n1. Samir will provide a detailed overview of the API documentation and use cases to the team.\n2. Will will work on integrating the APIs into production applications.\n3. Tom will coordinate with the team to gather feedback on the API program and provide updates on its general availability.\n4. The team will review and provide feedback on the API program and its capabilities."
  },
  {
    "id": "1",
    "timestamp": "2025-03-21 23:09:19",
    "filename": "OSR_us_000_0040_8k.wav",
    "transcript": " Most of the news is easy for us to hear. He used the lace to make brass objects. The bane on top of the pole revolved in the wind. Min's pie is a dish served to children. The cland gathered on each dull night. Let it burn, it gives us warmth and comfort. A castle built from sand fails to endure. A child's wit saved the day for us. Pack the strip of carpet to the warm floor. Next Tuesday we must vote.",
    "minutes": "MEETING MINUTES\n================\nDate: 2025-03-21 23:09\n\n**Meeting Minutes - [Date]**\n\n**Attendees:** [List the names of attendees, if any]\n\n**Key Points:**\n\n- The meeting discussed various topics, including the use of materials for crafting and the importance of warmth and comfort.\n- The group also touched on the theme of impermanence, as exemplified by a castle built from sand.\n- A child's wit was highlighted as a valuable asset in a challenging situation.\n- The need to pack a strip of carpet to a warm floor was mentioned.\n- A vote is scheduled for next Tuesday.\n\n**Action Items:**\n\n- Pack the strip of carpet to the warm floor (assignee: [Name, if specified])\n- Prepare for the vote scheduled for next Tuesday (assignee: [Name, if specified])\n\n**Decisions Made:**\n\n- None explicitly stated, but the meeting appears to be a discussion-oriented session rather than a decision-making one.\n\n**Discussion Details:**\n\n- The meeting started with a discussion on the use of lace to create brass objects, which was mentioned as a relatively straightforward process.\n- The group then shifted to the topic of a bane on top of a pole that revolved in the wind, which may have been used as a metaphor for the fleeting nature of things.\n- A pie served to children was mentioned, possibly as a reference to a comforting or nostalgic experience.\n- The cland gathering on each dull night may have been a reference to a natural phenomenon or a metaphor for something else.\n- The group discussed the importance of letting something burn in order to derive warmth and comfort from it.\n- A castle built from sand was used as an example of something that fails to endure, possibly serving as a metaphor for the impermanence of things.\n- A child's wit was highlighted as a valuable asset in a challenging situation, possibly serving as a reminder of the importance of creative problem-solving.\n- The need to pack a strip of carpet to a warm floor was mentioned, possibly as a practical task or a metaphor for something else.\n\n**Next Steps:**\n\n- The group will meet again next Tuesday to vote on a matter that was not specified in the meeting transcript.\n- The assignees for the action items (packing the strip of carpet and preparing for the vote) should complete their tasks before the next meeting.\n"
  }
]